In [2]:
import pandas as pd
import numpy as np

In [3]:
ratings = pd.read_csv(r'C:\Users\Windows 10\Desktop\Data Sets\livros\ratings.csv')

In [4]:
ratings.head()

   book_id  user_id  rating
0        1      314       5
1        1      439       3
2        1      588       5
3        1     1169       4
4        1     1185       4

In [5]:
ratings2 = pd.read_csv(r'C:\Users\Windows 10\Desktop\Data Sets\livros\ratings.csv')

In [6]:
ratings2.head()

   book_id  user_id  rating
0        1      314       5
1        1      439       3
2        1      588       5
3        1     1169       4
4        1     1185       4

Testando se os Data sets sâo iguais

In [7]:
ratings.equals(ratings2)

True

In [17]:
ratings.compare(ratings2, align_axis = 1, keep_shape = True).head()

  book_id       user_id       rating
     self other    self other   self other
0     NaN   NaN     NaN   NaN    NaN   NaN
1     NaN   NaN     NaN   NaN    NaN   NaN
2     NaN   NaN     NaN   NaN    NaN   NaN
3     NaN   NaN     NaN   NaN    NaN   NaN
4     NaN   NaN     NaN   NaN    NaN   NaN

In [28]:
ratings.columns

Index(['book_id', 'user_id', 'rating'], dtype='object')

Selecionando com condiçâo:

In [44]:
ratings.loc[ratings['user_id'] == 20]

        book_id  user_id  rating
859082     8689       20       5
904669     9168       20       4
965741     9827       20       4

In [48]:
ratings['user_id'].head()

0     314
1     439
2     588
3    1169
4    1185
Name: user_id, dtype: int64